Extra_tutorials/of7_chtMultiRegionFoam/evaporator/0.orig/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../properties"

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   $Tair;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    FluidInlet
    {
        type            fixedValue;
        value           $Tin;
    }
    FluidOutlet
    {
        type            inletOutlet;
        inletValue	$internalField;
        value           $internalField;
    }
    MicrochannelTop
    {
        type		externalWallHeatFluxTemperature;
    	mode            coefficient;
        Ta              $Tair;
        h               $hConv;
        thicknessLayers (2E-03 3.5E-03); //mm
        kappaLayers     ($KappaPyrex $kappaRigid10K);// thermal conductivity
 
        kappaMethod     solidThermo; 
        value           $internalField;  	
    }
    fluid_to_solid
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     fluidThermo;
    }
}

// ************************************************************************* //
