Extra_tutorials/of7_chtMultiRegionFoam/evaporator/0.orig/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    FluidInlet
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 2.5e-5;
        rhoInlet        997.67;
        extrapolateProfile yes;
        value           uniform (0 0 0);
    }
    FluidOutlet
    {
        type            inletOutlet;
        inletValue	uniform (0 0 0);
        value		uniform (0 0 0);
    }
    fluid_to_solid // Name is built by splitMeshRegion
    {
        type            noSlip;
    } 
    MicrochannelTop
    {
    	type		noSlip;
    }
}

// ************************************************************************* //
