Extra_tutorials/of7_chtMultiRegionFoam/evaporator/0.orig/fluid/heatFlux
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      heatFlux;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [ 0 0 0 1 0 0 0 ];

internalField   0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(FluidInlet|FluidOutlet|MicrochannelTop|fluid_to_solid)"
    {
        type            groovyBC;
        valueExpression "kappa*snGrad(T)";
        value		uniform 0;
    }
}

// ************************************************************************* //
