Extra_tutorials/of7_chtMultiRegionFoam/evaporator/Allmesh.serial
#!/bin/sh
cd ${0%/*} || exit 1

./Allclean
blockMesh
surfaceFeatures
snappyHexMesh -overwrite 
splitMeshRegions -cellZonesOnly -overwrite # CellZonesOnly 
#createPatch -region solid -overwrite 
checkMesh 
touch view.foam
