Extra_tutorials/of7_chtMultiRegionFoam/evaporator/constant/solid/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/metal";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          hConst;//eConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;//sensibleInternalEnergy;
}

mixture
{
    // Edelstahl 1.4401
    specie
    {
        molWeight       55.845; // Iron
    }
    equationOfState
    {
        rho             8000;
    }
    transport
    {
        kappa           15;
    }
    thermodynamics
    {
        Hf              0; // Wiki Heat of Formation Iron
        Cp              500;
    }
}

// ************************************************************************* //
