Extra_tutorials/of7_chtMultiRegionFoam/evaporator/system/PostProcessingGraphs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

singleGraphGlasLid
{
	#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"
	start   (-0.03175 -0.002005 0);
	end     (0.03175 -0.002005 0);
	fields  (U p T);
	region fluid;
	#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"
}
singleGraphH1
{
	#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"
	start   (-0.03175 -0.002005 -0.000745);
	end     (-0.03175 -0.002005 0.000745);
	fields  (U p T);
	region fluid;
	#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"
}
singleGraphH2
{
	#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"
	start   (-0.015875 -0.002005 -0.000745);
	end     (-0.015875 -0.002005 0.000745);
	fields  (U p T);
	region fluid;
	#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"
}
singleGraphH3
{
	#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"
	start   (0 -0.002005 -0.000745);
	end     (0 -0.002005 0.000745);
	fields  (U p T);
	region fluid;
	#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"
}
singleGraphH4
{
	#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"
	start   (0.015875 -0.002005 -0.000745);
	end     (0.015875 -0.002005 0.000745);
	fields  (U p T);
	region fluid;
	#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"
}
singleGraphH5
{
	#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"
	start   (0.03175 -0.002005 -0.000745);
	end     (0.03175 -0.002005 0.000745);
	fields  (U p T);
	region fluid;
	#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"
}


// ************************************************************************* //
