Extra_tutorials/of7_chtMultiRegionFoam/evaporator/system/PreProcessing
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

fluidResiduals
{
    #includeEtc "caseDicts/postProcessing/numerical/residuals.cfg"
    region fluid;
    fields (p_rgh U h);
}
solidResiduals
{
    #includeEtc "caseDicts/postProcessing/numerical/residuals.cfg"
    region solid;
    fields (h);
}
singleGraphFluid
{
	#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"
	start   (-0.03175 -0.00235 0);
	end     (0.03175 -0.00235 0);
	region fluid;
	fields  (U p T);
	#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"
}
singleGraphGlasLid
{
	#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"
	start   (-0.03175 -0.002105 0);
	end     (0.03175 -0.002105 0);
	region fluid;
	fields  (U p T);
	#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"
}
tempAverageInlet
{
	name    FluidInlet;
	region	fluid;
	fields  (T);
	
	operation areaAverage;
	#includeEtc "caseDicts/postProcessing/surfaceFieldValue/patch.cfg"
}
tempAverageOutlet
{
	name    FluidOutlet;
	region	fluid;
	fields  (T);
	
	operation areaAverage;
	#includeEtc "caseDicts/postProcessing/surfaceFieldValue/patch.cfg"
}
tempAverageOutlet
{
	name    MicrochannelTop;
	region	fluid;
	fields  (T);
	
	operation areaAverage;
	#includeEtc "caseDicts/postProcessing/surfaceFieldValue/patch.cfg"
}


// ************************************************************************* //
