Extra_tutorials/of7_chtMultiRegionFoam/evaporator/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

backgroundMesh 
{
    xMin   -35.3; 
    xMax   35.3;
    yMin   -8.1;
    yMax   -1;  
    zMin   -5; 
    zMax   5;
}

convertToMeters 0.001; 

vertices
(
    ($:backgroundMesh.xMin $:backgroundMesh.yMin $:backgroundMesh.zMin)
    ($:backgroundMesh.xMax $:backgroundMesh.yMin $:backgroundMesh.zMin)
    ($:backgroundMesh.xMax $:backgroundMesh.yMax $:backgroundMesh.zMin)
    ($:backgroundMesh.xMin $:backgroundMesh.yMax $:backgroundMesh.zMin)

    ($:backgroundMesh.xMin $:backgroundMesh.yMin $:backgroundMesh.zMax)
    ($:backgroundMesh.xMax $:backgroundMesh.yMin $:backgroundMesh.zMax)
    ($:backgroundMesh.xMax $:backgroundMesh.yMax $:backgroundMesh.zMax)
    ($:backgroundMesh.xMin $:backgroundMesh.yMax $:backgroundMesh.zMax)
);

blocks
(
          //hex (0 1 2 3 4 5 6 7) fluid (140 18 20) simpleGrading (1 1 1)
	  hex (0 1 2 3 4 5 6 7) fluid (280 36 40) simpleGrading (1 1 1)
	//hex (0 1 2 3 4 5 6 7) fluid (280 48 60) simpleGrading (1 1 1)
	//hex (0 1 2 3 4 5 6 7) fluid (280 72 80) simpleGrading (1 1 1)	
);

edges
(
);

boundary
(
    Background
    {
    	type patch;
        faces
        (
            (4 5 6 7)
            (0 1 2 3)
            (0 1 5 4)
            (3 2 6 7)
            (0 4 7 3)
            (2 6 5 1)
        );
    }	
);

defaultPatch 
{
    type empty;
    name default;
}

// ************************************************************************* //
