Extra_tutorials/of7_chtMultiRegionFoam/evaporator/system/solid/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync   false;

patches
(
    {
        name    External;
        patchInfo
        {
            type    wall;
        }
        constructFrom patches;
        patches     ("FluidInlet" "FluidOutlet" " External");
    }
);

// ************************************************************************* //
