Extra_tutorials/of7_chtMultiRegionFoam/evaporator/system/solid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/solid";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    h
    {
        solver           GAMG;
        smoother         symGaussSeidel;
        tolerance        1e-7;
        relTol           0.1;
    }

    hFinal
    {
        $h;
        relTol           0;
    }
}

PIMPLE
{
    residualControl
    {
        h				1e-7;
    }
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
    equations
    {
        h               0.9; 
    }
}


// ************************************************************************* //
