Extra_tutorials/of7_chtMultiRegionFoam/evaporator/system/solid/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
     {
        name    h1;
        type    faceZoneSet;
        action  new;
	source searchableSurfaceToFaceZone;
        sourceInfo
        {
            surface triSurfaceMesh;
            name  h1.stl; 
        }
     }
     {
        name    h2;
        type    faceZoneSet;
        action  new;
	source searchableSurfaceToFaceZone;
        sourceInfo
        {
            surface triSurfaceMesh;
            name  h2.stl; 
        }
     }
     {
        name    h3;
        type    faceZoneSet;
        action  new;
	source searchableSurfaceToFaceZone;
        sourceInfo
        {
            surface triSurfaceMesh;
            name  h3.stl; 
        }
     }
     {
        name    h4;
        type    faceZoneSet;
        action  new;
	source searchableSurfaceToFaceZone;
        sourceInfo
        {
            surface triSurfaceMesh;
            name  h4.stl; 
        }
     }
     {
        name    h5;
        type    faceZoneSet;
        action  new;
	source searchableSurfaceToFaceZone;
        sourceInfo
        {
            surface triSurfaceMesh;
            name  h5.stl; 
        }
     }
     {
        name    h6;
        type    faceZoneSet;
        action  new;
	source searchableSurfaceToFaceZone;
        sourceInfo
        {
            surface triSurfaceMesh;
            name  h6.stl; 
        }
     }
     {
        name    h7;
        type    faceZoneSet;
        action  new;
	source searchableSurfaceToFaceZone;
        sourceInfo
        {
            surface triSurfaceMesh;
            name  h7.stl; 
        }
     }
     {
        name    h8;
        type    faceZoneSet;
        action  new;
	source searchableSurfaceToFaceZone;
        sourceInfo
        {
            surface triSurfaceMesh;
            name  h8.stl; 
        }
     }
     {
        name    h9;
        type    faceZoneSet;
        action  new;
	source searchableSurfaceToFaceZone;
        sourceInfo
        {
            surface triSurfaceMesh;
            name  h9.stl; 
        }
     }
     {
        name    h10;
        type    faceZoneSet;
        action  new;
	source searchableSurfaceToFaceZone;
        sourceInfo
        {
            surface triSurfaceMesh;
            name  h10.stl; 
        }
     }
     {
        name    h11;
        type    faceZoneSet;
        action  new;
	source searchableSurfaceToFaceZone;
        sourceInfo
        {
            surface triSurfaceMesh;
            name  h11.stl; 
        }
     }
    

);

// ************************************************************************* //
